In [1]:
import pandas as pd

In [2]:
sales = pd.DataFrame( {'weekday': ['Sun', 'Sun', 'Mon', 'Mon'], 'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],'bread': [139, 237, 326, 456], 'butter': [20, 45, 70, 98] })

In [3]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

### boolean filter and count

In [4]:
sales.loc[sales["weekday"] == "Sun"].count

<bound method DataFrame.count of   weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45>

### using the groupby method from pandas

In [5]:
sales.groupby("weekday").count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

#### groupby and sum

In [6]:
sales.groupby("weekday")[["bread"]].sum()

         bread
weekday
Mon        782
Sun        376

#### groupby and sum: multiple columns

In [7]:
sales.groupby("weekday")[["bread", "butter"]].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

#### groupby and mean: multi-level index

In [8]:
sales.groupby(["city", "weekday"]).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [9]:
customers = pd.Series(['Dave','Alice','Bob','Alice'])

In [10]:
sales.groupby(customers)["bread"].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

### categorical data

In [11]:
sales["weekday"].unique()

array(['Sun', 'Mon'], dtype=object)

In [12]:
sales["weekday"] = sales["weekday"].astype("category")

In [13]:
sales["weekday"]

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

## Grouping by multiple columns
In this exercise, you will return to working with the Titanic dataset from Chapter 1 and use .groupby() to analyze the distribution of passengers who boarded the Titanic.

The 'pclass' column identifies which class of ticket was purchased by the passenger and the 'embarked' column indicates at which of the three ports the passenger boarded the Titanic. 'S' stands for Southampton, England, 'C' for Cherbourg, France and 'Q' for Queenstown, Ireland.

Your job is to first group by the 'pclass' column and count the number of rows in each class using the 'survived' column. You will then group by the 'embarked' and 'pclass' columns and count the number of passengers.

The DataFrame has been pre-loaded as titanic.

- Group by the 'pclass' column and save the result as by_class.
- Aggregate the 'survived' column of by_class using .count(). Save the result as count_by_class.
- Print count_by_class. This has been done for you.
- Group titanic by the 'embarked' and 'pclass' columns. Save the result as by_mult.
- Aggregate the 'survived' column of by_mult using .count(). Save the result as count_mult.
- Print count_mult. This has been done for you, so hit 'Submit Answer' to view the result.

In [3]:
titanic = pd.read_csv("titanic.csv")

In [15]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [17]:
# Group titanic by 'pclass'
by_class = titanic.groupby("pclass")

In [18]:
by_class

In [19]:
# Aggregate 'survived' column of by_class by count
count_by_class = by_class["survived"].count()

In [20]:
count_by_class

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [21]:
# Group titanic by 'embarked' and 'pclass'
by_mult = titanic.groupby(["embarked","pclass"])

In [22]:
# Aggregate 'survived' column of by_mult by count
count_mult = by_mult["survived"].count()

In [23]:
# Print count_mult
print(count_mult)

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

### Grouping by another series
In this exercise, you'll use two data sets from Gapminder.org to investigate the average life expectancy (in years) at birth in 2010 for the 6 continental regions. To do this you'll read the life expectancy data per country into one pandas DataFrame and the association between country and region into another.

By setting the index of both DataFrames to the country name, you'll then use the region information to group the countries in the life expectancy DataFrame and compute the mean value for 2010.

The life expectancy CSV file is available to you in the variable life_fname and the regions filename is available in the variable regions_fname.

- Read life_fname into a DataFrame called life and set the index to 'Country'.
- Read regions_fname into a DataFrame called regions and set the index to 'Country'.
- Group life by the region column of regions and store the result in life_by_region.
- Print the mean over the 2010 column of life_by_region

In [25]:
# Read life_fname into a DataFrame: life
life_fname = "gapminder_tidy.csv"
life = pd.read_csv(life_fname, index_col='Country')

In [26]:
life

,Year,fertility,life,population,child_mortality,gdp,region
Country,,,,,,,
Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia
...,...,...,...,...,...,...,...
Åland,2002,NaN,81.800,26257.0,NaN,NaN,Europe & Central Asia
Åland,2003,NaN,80.630,26347.0,NaN,NaN,Europe & Central Asia
Åland,2004,NaN,79.880,26530.0,NaN,NaN,Europe & Central Asia
Åland,2005,NaN,80.000,26766.0,NaN,NaN,Europe & Central Asia
Åland,2006,NaN,80.100,26923.0,NaN,NaN,Europe & Central Asia

In [27]:
regions = life[["region"]]

In [28]:
regions

                            region
Country
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
...                            ...
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia

[10111 rows x 1 columns]

In [29]:
del (life["region"])

In [39]:
#life

In [36]:
# Group life by regions['region']: life_by_region
life_by_region = life.groupby(regions["region"])

In [37]:
life_by_region["2010"].mean()

KeyError: 'Column not found: 2010'

## Groupby and aggregation

In [40]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [41]:
sales.groupby('city')[['bread','butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

3### multiple aggregations

In [42]:
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

### custom aggregations

In [44]:
# define custom function
def data_range(series):
    return series.max() - series.min()

In [45]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

### Custom aggregation: dictionaries

In [46]:
sales.groupby(customers)[['bread', 'butter']].agg({'bread':'sum', 'butter':data_range})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

## Computing multiple aggregates of multiple columns
The .agg() method can be used with a tuple or list of aggregations as input. When applying multiple aggregations on multiple columns, the aggregated DataFrame has a multi-level column index.

In this exercise, you're going to group passengers on the Titanic by 'pclass' and aggregate the 'age' and 'fare' columns by the functions 'max' and 'median'. You'll then use multi-level selection to find the oldest passenger per class and the median fare price per class.

The DataFrame has been pre-loaded as titanic.

- Group titanic by 'pclass' and save the result as by_class.
- Select the 'age' and 'fare' columns from by_class and save the result as by_class_sub.
- Aggregate by_class_sub using 'max' and 'median'. You'll have to pass 'max' and 'median' in the form of a list to .agg().
- Use .loc[] to print all of the rows and the column specification ('age','max'). This has been done for you.
- Use .loc[] to print all of the rows and the column specification ('fare','median').

In [47]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [48]:
# Group titanic by 'pclass': by_class
by_class = titanic.groupby("pclass")

In [49]:
# Select 'age' and 'fare'
by_class_sub = by_class[['age','fare']]

In [51]:
# Aggregate by_class_sub by 'max' and 'median': aggregated
aggregated = by_class_sub.agg(["max", "median"])

In [52]:
# Print the maximum age in each class
print(aggregated.loc[:, ('age','max')])

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [53]:
# Print the median fare in each class
print(aggregated.loc[:, ('fare','median')])

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

### Aggregating on index levels/fields
If you have a DataFrame with a multi-level row index, the individual levels can be used to perform the groupby. This allows advanced aggregation techniques to be applied along one or more levels in the index and across one or more columns.

In this exercise you'll use the full Gapminder dataset which contains yearly values of life expectancy, population, child mortality (per 1,000) and per capita gross domestic product (GDP) for every country in the world from 1964 to 2013.

Your job is to create a multi-level DataFrame of the columns 'Year', 'Region' and 'Country'. Next you'll group the DataFrame by the 'Year' and 'Region' levels. Finally, you'll apply a dictionary aggregation to compute the total population, spread of per capita GDP values and average child mortality rate.

- The Gapminder CSV file is available as 'gapminder.csv'.
- Read 'gapminder.csv' into a DataFrame with index_col=['Year','region','Country']. Sort the index.
- Group gapminder with a level of ['Year','region'] using its level parameter. Save the result as by_year_region.
- Define the function spread which returns the maximum and minimum of an input series. This has been done for you.
- Create a dictionary with 'population':'sum', 'child_mortality':'mean' and 'gdp':spread as aggregator. This has been done for you.
- Use the aggregator dictionary to aggregate by_year_region. Save the result as aggregated.
- Print the last 6 entries of aggregated. This has been done for you, so hit 'Submit Answer' to view the result.

In [3]:
gapminder = pd.read_csv("gapminder_tidy.csv", index_col=['Year','region','Country'])

In [5]:
# Read the CSV file into a DataFrame and sort the index: gapminder
gapminder = gapminder.sort_index()

In [6]:
gapminder

                                             fertility    life  population  \
Year region             Country
1964 America            Antigua and Barbuda      4.250  63.775     58653.0
                        Argentina                3.068  65.388  21966478.0
                        Aruba                    4.059  67.113     57031.0
                        Bahamas                  4.220  64.189    133709.0
                        Barbados                 4.094  62.819    234455.0
...                                                ...     ...         ...
2013 Sub-Saharan Africa Tanzania                 5.214  61.530  49153002.0
                        Togo                     4.639  56.537   6412560.0
                        Uganda                   5.867  59.209  36759274.0
                        Zambia                   5.687  58.105  14314515.0
                        Zimbabwe                 3.486  59.871  13327925.0

                                             child_mortality      gdp
Year region             Country
1964 America            Antigua and Barbuda            72.78   5008.0
                        Argentina                      57.43   8227.0
                        Aruba                            NaN   5505.0
                        Bahamas                        48.56  18160.0
                        Barbados                       64.70   5681.0
...                                                      ...      ...
2013 Sub-Saharan Africa Tanzania                       52.60   2382.0
                        Togo                           83.30   1346.0
                        Uganda                         65.10   1621.0
                        Zambia                         72.80   3800.0
                        Zimbabwe                       83.30   1773.0

[10111 rows x 5 columns]

In [16]:
# Group gapminder by 'Year' and 'region': by_year_region
#by_year_region = gapminder.groupby(level=[0,1])
by_year_region = gapminder.groupby(level=["Year","region"])

In [17]:
# Define the function to compute spread: spread
def spread(series):
    return series.max() - series.min()

In [18]:
# Create the dictionary: aggregator
aggregator = {'population':'sum', 'child_mortality':'mean', 'gdp':spread}

In [19]:
# Aggregate by_year_region using the dictionary: aggregated
aggregated = by_year_region.agg(aggregator)

In [20]:
# Print the last 6 entries of aggregated 
aggregated.tail(6)

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

### Grouping on a function of the index
Groupby operations can also be performed on transformations of the index values. In the case of a DateTimeIndex, we can extract portions of the datetime over which to group.

In this exercise you'll read in a set of sample sales data from February 2015 and assign the 'Date' column as the index. Your job is to group the sales data by the day of the week and aggregate the sum of the 'Units' column.

Is there a day of the week that is more popular for customers? To find out, you're going to use .strftime('%a') to transform the index datetime values to abbreviated days of the week.

The sales data CSV file is available to you as 'sales.csv'.

- Read 'sales.csv' into a DataFrame with index_col='Date' and parse_dates=True.
- Create a groupby object with sales.index.strftime('%a') as input and assign it to by_day.
- Aggregate the 'Units' column of by_day with the .sum() method. Save the result as units_sum.
- Print units_sum. This has been done for you, so hit 'Submit Answer' to see the result.

In [26]:
sales = pd.read_csv("sales-feb-2015.csv", index_col="Date", parse_dates=True)

In [27]:
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [28]:
# Create a groupby object: by_day
by_day = sales.groupby(sales.index.strftime('%a'))

In [35]:
# Create sum: units_sum
units_sum = by_day['Units'].agg(sum)

In [36]:
# Print units_sum
units_sum

Date
Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

## Groupby and transfromation

In [45]:
# https://en.wikipedia.org/wiki/Standard_score
""" In statistics, the standard score is the number of standard deviations by which the value of a raw score 
(i.e., an observed value or data point) is above or below the mean value of what is being observed or measured. 
Raw scores above the mean have positive standard scores, while those below the mean have negative standard scores."""
def zscore(series):
    return (series - series.mean()) / series.std()

In [41]:
auto = pd.read_csv("auto-mpg.csv")

In [42]:
auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [43]:
zscore(auto["mpg"]).head()

0   -0.705551
1   -1.089379
2   -0.705551
3   -0.961437
4   -0.833494
Name: mpg, dtype: float64

### MGP score by year

In [48]:
auto.groupby("model_year")["mpg"].transform(zscore).head()

0    0.058125
1   -0.503753
2    0.058125
3   -0.316460
4   -0.129168
Name: mpg, dtype: float64

In [54]:
def zscore_with_year_and_name(group):
    df = pd.DataFrame(
    {'mpg': zscore(group['mpg']),
    'year': group['model_year'],
    'name': group['car_name']})
    return df

In [57]:
auto.groupby('model_year').apply(zscore_with_year_and_name).head()

        mpg  year                       name
0  0.058125    70  chevrolet chevelle malibu
1 -0.503753    70          buick skylark 320
2  0.058125    70         plymouth satellite
3 -0.316460    70              amc rebel sst
4 -0.129168    70                ford torino

# The z-score is also useful to find outliers: a z-score value of +/- 3 is generally considered to be an outlier.

In [9]:
# Import zscore
#from scipy.stats import zscore

In [2]:
gapminder = pd.read_csv("gapminder_tidy.csv", parse_dates=True)

In [3]:
gapminder_2010 = gapminder[gapminder["Year"] == 2010]

In [7]:
gapminder_2010

,Country,Year,fertility,life,population,child_mortality,gdp,region
46,Afghanistan,2010,5.659,59.612,31411743.0,105.00,1637.0,South Asia
96,Albania,2010,1.741,76.780,3204284.0,16.60,9374.0,Europe & Central Asia
146,Algeria,2010,2.817,70.615,35468208.0,27.40,12494.0,Middle East & North Africa
196,Angola,2010,6.218,50.689,19081912.0,182.50,7047.0,Sub-Saharan Africa
246,Antigua and Barbuda,2010,2.130,75.437,88710.0,9.90,20567.0,America
...,...,...,...,...,...,...,...,...
9897,West Bank and Gaza,2010,4.216,72.640,4039192.0,23.80,4163.0,Middle East & North Africa
9947,Western Sahara,2010,2.471,66.844,530500.0,50.71,NaN,Middle East & North Africa
9997,"Yemen, Rep.",2010,4.498,62.536,24052514.0,NaN,NaN,Middle East & North Africa
10047,Zambia,2010,5.813,54.549,13088570.0,84.80,3451.0,Sub-Saharan Africa
10097,Zimbabwe,2010,3.721,53.684,12571454.0,95.10,1484.0,Sub-Saharan Africa

## Detecting outliers with Z-Scores
As Dhavide demonstrated in the video using the zscore function, you can apply a .transform() method after grouping to apply a function to groups of data independently. The z-score is also useful to find outliers: a z-score value of +/- 3 is generally considered to be an outlier.

In this example, you're going to normalize the Gapminder data in 2010 for life expectancy and fertility by the z-score per region. Using boolean indexing, you will filter for countries that have high fertility rates and low life expectancy for their region.

The Gapminder DataFrame for 2010 indexed by 'Country' is provided for you as gapminder_2010.

- Import zscore from scipy.stats.
- Group gapminder_2010 by 'region' and transform the ['life','fertility'] columns by zscore.
- Construct a boolean Series of the bitwise or between standardized['life'] < -3 and standardized['fertility'] > 3.
- Filter gapminder_2010 using .loc[] and the outliers Boolean Series. Save the result as gm_outliers.
- Print gm_outliers. This has been done for you, so hit 'Submit Answer' to see the results.

In [8]:
# Import zscore
from scipy.stats import zscore

In [10]:
# Group gapminder_2010: standardized
standardized = gapminder.groupby("region")['life','fertility'].transform(zscore)

D:\Programs\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [11]:
standardized

           life  fertility
0     -2.289170   1.477737
1     -2.239195   1.477737
2     -2.189513   1.477737
3     -2.140025   1.477737
4     -2.090927   1.477737
...         ...        ...
10106  1.917707        NaN
10107  1.690350        NaN
10108  1.544608        NaN
10109  1.567927        NaN
10110  1.587359        NaN

[10111 rows x 2 columns]

In [13]:
# Construct a Boolean Series to identify outliers: outliers
outliers = (standardized['life'] < -3) | (standardized['fertility'] > 3)

In [14]:
# Filter gapminder_2010 by the outliers: gm_outliers
gm_outliers = gapminder_2010.loc[outliers]

In [15]:
# Print gm_outliers
gm_outliers

,Country,Year,fertility,life,population,child_mortality,gdp,region
3846,Haiti,2010,3.35,45.0,9993247.0,208.8,1518.0,America

## Filling missing data (imputation) by group
Many statistical and machine learning packages cannot determine the best action to take when missing data entries are encountered. Dealing with missing data is natural in pandas (both in using the default behavior and in defining a custom behavior). In Chapter 1, you practiced using the .dropna() method to drop missing values. Now, you will practice imputing missing values. You can use .groupby() and .transform() to fill missing data appropriately for each group.

Your job is to fill in missing 'age' values for passengers on the Titanic with the median age from their 'gender' and 'pclass'. To do this, you'll group by the 'sex' and 'pclass' columns and transform each group with a custom function to call .fillna() and impute the median value.

The DataFrame has been pre-loaded as titanic. Explore it in the IPython Shell by printing the output of titanic.tail(10). Notice in particular the NaNs in the 'age' column.

- Group titanic by 'sex' and 'pclass'. Save the result as by_sex_class.
- Write a function called impute_median() that fills missing values with the median of a series. This has been done for you.
- Call .transform() with impute_median on the 'age' column of by_sex_class.
- Print the output of titanic.tail(10). This has been done for you - hit 'Submit Answer' to see how the missing values have now been imputed.

In [26]:
titanic = pd.read_csv("titanic.csv")

In [27]:
titanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [28]:
# Create a groupby object: by_sex_class
by_sex_class = titanic.groupby(["sex","pclass"])

In [29]:
# Write a function that imputes median
def impute_median(series):
    return series.fillna(series.median())

In [30]:
titanic["age"] = by_sex_class["age"].transform(impute_median)

In [31]:
titanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,25.0,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,25.0,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,22.0,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

## Other transformations with .apply
The .apply() method when used on a groupby object performs an arbitrary function on each of the groups. These functions can be aggregations, transformations or more complex workflows. The .apply() method will then combine the results in an intelligent way.

In this exercise, you're going to analyze economic disparity within regions of the world using the Gapminder data set for 2010. To do this you'll define a function to compute the aggregate spread of per capita GDP in each region and the individual country's z-score of the regional per capita GDP. You'll then select three countries - United States, Great Britain and China - to see a summary of the regional GDP and that country's z-score against the regional mean.

The 2010 Gapminder DataFrame is provided for you as gapminder_2010. Pandas has been imported as pd.

The following function has been defined for your use:

In [6]:
def disparity(gr):
    # Compute the spread of gr['gdp']: s
    s = gr['gdp'].max() - gr['gdp'].min()
    # Compute the z-score of gr['gdp'] as (gr['gdp']-gr['gdp'].mean())/gr['gdp'].std(): z
    z = (gr['gdp'] - gr['gdp'].mean())/gr['gdp'].std()
    # Return a DataFrame with the inputs {'z(gdp)':z, 'regional spread(gdp)':s}
    return pd.DataFrame({'z(gdp)':z , 'regional spread(gdp)':s})

- Group gapminder_2010 by 'region'. Save the result as regional.
- Apply the provided disparity function on regional, and save the result as reg_disp.
- Use .loc[] to select ['United States','United Kingdom','China'] from reg_disp and print the results.

In [5]:
gapminder_2010.head(3)

,Country,Year,fertility,life,population,child_mortality,gdp,region
46,Afghanistan,2010,5.659,59.612,31411743.0,105.0,1637.0,South Asia
96,Albania,2010,1.741,76.780,3204284.0,16.6,9374.0,Europe & Central Asia
146,Algeria,2010,2.817,70.615,35468208.0,27.4,12494.0,Middle East & North Africa

In [14]:
# Group gapminder_2010 by 'region': regional
regional = gapminder_2010.groupby("region")

In [15]:
# Apply the disparity function on regional: reg_disp
reg_disp = regional.apply(disparity)

In [17]:
# Print the disparity of 'United States', 'United Kingdom', and 'China'
reg_disp

         z(gdp)  regional spread(gdp)
46    -1.011602               10037.0
96    -0.986190               89037.0
146   -0.550537              125319.0
196    0.398221               33817.0
246    0.431274               47855.0
...         ...                   ...
9897  -0.816251              125319.0
9947        NaN              125319.0
9997        NaN              125319.0
10047 -0.167488               33817.0
10097 -0.476930               33817.0

[202 rows x 2 columns]

## groupby and filtering

In [19]:
auto = pd.read_csv("auto-mpg.csv")

In [20]:
auto.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite

In [22]:
auto.groupby("model_year")["mpg"].mean()

model_year
70    17.689655
71    21.250000
72    18.714286
73    17.100000
74    22.703704
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.696552
81    30.334483
82    31.709677
Name: mpg, dtype: float64

wha if we need mean only for cards biolt by Chevrolet?

in this acse we need filter the groups before aggregating

In [23]:
splitting = auto.groupby("model_year")

In [24]:
type(splitting)

pandas.core.groupby.generic.DataFrameGroupBy

In [30]:
#spliting.groups

In [25]:
type(splitting.groups)

dict

In [28]:
splitting.groups.keys()

dict_keys([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [31]:
for group_name, group in splitting:
    avg = group['mpg'].mean()
    print(group_name, avg)

70 17.689655172413794
71 21.25
72 18.714285714285715
73 17.1
74 22.703703703703702
75 20.266666666666666
76 21.573529411764707
77 23.375
78 24.061111111111114
79 25.09310344827585
80 33.696551724137926
81 30.33448275862069
82 31.70967741935484

In [33]:
#we can filter before aggregating
for group_name, group in splitting:
    avg = group.loc[group['car_name'].str.contains('chevrolet'), 'mpg'].mean()
    print(group_name, avg)

70 15.666666666666666
71 20.25
72 15.333333333333334
73 14.833333333333334
74 18.666666666666668
75 17.666666666666668
76 23.25
77 20.25
78 23.233333333333334
79 21.666666666666668
80 30.05
81 23.5
82 29.0

In [37]:
#using dictionary comprehension
chevy_means = {year:group.loc[group['car_name'].str.contains('chevrolet'),'mpg'].mean() for year, group in splitting}

In [36]:
chevy_means

{70: 15.666666666666666,
 71: 20.25,
 72: 15.333333333333334,
 73: 14.833333333333334,
 74: 18.666666666666668,
 75: 17.666666666666668,
 76: 23.25,
 77: 20.25,
 78: 23.233333333333334,
 79: 21.666666666666668,
 80: 30.05,
 81: 23.5,
 82: 29.0}

In [40]:
#boolean groupby
chevy = auto['car_name'].str.contains('chevrolet')

In [41]:
chevy

0       True
1      False
2      False
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Name: car_name, Length: 398, dtype: bool

In [45]:
auto.groupby(['model_year', chevy])['mpg'].mean()

model_year  car_name
70          False       17.923077
            True        15.666667
71          False       21.416667
            True        20.250000
72          False       19.120000
            True        15.333333
73          False       17.500000
            True        14.833333
74          False       23.208333
            True        18.666667
75          False       20.555556
            True        17.666667
76          False       21.350000
            True        23.250000
77          False       23.895833
            True        20.250000
78          False       24.136364
            True        23.233333
79          False       25.488462
            True        21.666667
80          False       33.966667
            True        30.050000
81          False       30.578571
            True        23.500000
82          False       32.111111
            True        29.000000
Name: mpg, dtype: float64

## Grouping and filtering with .apply()
By using .apply(), you can write functions that filter rows within groups. The .apply() method will handle the iteration over individual groups and then re-combine them back into a Series or DataFrame.

In this exercise you'll take the Titanic data set and analyze survival rates from the 'C' deck, which contained the most passengers. To do this you'll group the dataset by 'sex' and then use the .apply() method on a provided user defined function which calculates the mean survival rates on the 'C' deck:

- Group titanic by 'sex'. Save the result as by_sex.
- Apply the provided c_deck_survival function on the by_sex DataFrame. Save the result as c_surv_by_sex.
- Print c_surv_by_sex.

In [2]:
def c_deck_survival(gr):

    c_passengers = gr['cabin'].str.startswith('C').fillna(False)

    return gr.loc[c_passengers, 'survived'].mean()

In [4]:
# Create a groupby object using titanic over the 'sex' column: by_sex
by_sex = titanic.groupby("sex")

In [5]:
# Call by_sex.apply with the function c_deck_survival
c_surv_by_sex = by_sex.apply(c_deck_survival)

In [6]:
c_surv_by_sex

sex
female    0.913043
male      0.312500
dtype: float64

## Grouping and filtering with .filter()
You can use groupby with the .filter() method to remove whole groups of rows from a DataFrame based on a boolean condition.

In this exercise, you'll take the February sales data and remove entries from companies that purchased less than or equal to 35 Units in the whole month.

First, you'll identify how many units each company bought for verification. Next you'll use the .filter() method after grouping by 'Company' to remove all rows belonging to companies whose sum over the 'Units' column was less than or equal to 35. Finally, verify that the three companies whose total Units purchased were less than or equal to 35 have been filtered out from the DataFrame.

- Group sales by 'Company'. Save the result as by_company.
- Compute and print the sum of the 'Units' column of by_company.
- Call .filter() on by_company with lambda g:g['Units'].sum() > 35 as input and print the result.

In [7]:
sales = pd.read_csv("sales-feb-2015.csv", index_col="Date", parse_dates=True)

In [8]:
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [9]:
# Group sales by 'Company': by_company
by_company = sales.groupby("Company")

In [10]:
# Compute the sum of the 'Units' of by_company: by_com_sum
by_com_sum = by_company["Units"].sum
print(by_com_sum)

<bound method GroupBy.sum of <pandas.core.groupby.generic.SeriesGroupBy object at 0x000001DC9486FD08>>

In [12]:
# Filter 'Units' where the sum is > 35: by_com_filt
by_com_filt = by_company.filter(lambda g:g['Units'].sum() > 35)
print(by_com_filt)

                       Company   Product  Units
Date
2015-02-02 21:00:00  Mediacore  Hardware      9
2015-02-04 15:30:00  Streeplex  Software     13
2015-02-09 09:00:00  Streeplex   Service     19
2015-02-09 13:00:00  Mediacore  Software      7
2015-02-19 11:00:00  Mediacore  Hardware     16
2015-02-19 16:00:00  Mediacore   Service     10
2015-02-21 05:00:00  Mediacore  Software      3
2015-02-26 09:00:00  Streeplex   Service      4

## Filtering and grouping with .map()
You have seen how to group by a column, or by multiple columns. Sometimes, you may instead want to group by a function/transformation of a column. The key here is that the Series is indexed the same way as the DataFrame. You can also mix and match column grouping with Series grouping.

In this exercise your job is to investigate survival rates of passengers on the Titanic by 'age' and 'pclass'. In particular, the goal is to find out what fraction of children under 10 survived in each 'pclass'. You'll do this by first creating a boolean array where True is passengers under 10 years old and False is passengers over 10. You'll use .map() to change these values to strings.

Finally, you'll group by the under 10 series and the 'pclass' column and aggregate the 'survived' column. The 'survived' column has the value 1 if the passenger survived and 0 otherwise. The mean of the 'survived' column is the fraction of passengers who lived.

The DataFrame has been pre-loaded for you as titanic.

- Create a Boolean Series of titanic['age'] < 10 and call .map with {True:'under 10', False:'over 10'}.
- Group titanic by the under10 Series and then compute and print the mean of the 'survived' column.
- Group titanic by the under10 Series as well as the 'pclass' column and then compute and print the mean of the 'survived' column.

In [16]:
# Create the Boolean Series: under10
under10 = titanic["age"] < 10 
under10 = under10.map({True:'under 10', False:'over 10'})

0        over 10
1       under 10
2       under 10
3        over 10
4        over 10
          ...
1304     over 10
1305     over 10
1306     over 10
1307     over 10
1308     over 10
Name: age, Length: 1309, dtype: object

In [19]:
# Group by under10 and compute the survival rate
survived_mean_1 = titanic.groupby(under10)["survived"].mean()
print(survived_mean_1)

age
over 10     0.366748
under 10    0.609756
Name: survived, dtype: float64

In [22]:
# Group by under10 and pclass and compute the survival rate
survived_mean_2 = titanic.groupby([under10,"pclass"])["survived"].mean()
print(survived_mean_2)

age       pclass
over 10   1         0.617555
          2         0.380392
          3         0.238897
under 10  1         0.750000
          2         1.000000
          3         0.446429
Name: survived, dtype: float64